### Terraform Plan Results

#### Format Check: `failure`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```terraform
random_id.db_name_suffix: Refreshing state... [id=UjGNwA]
random_password.db_password: Refreshing state... [id=none]
data.google_client_config.default: Reading...
data.google_project.current: Reading...
google_secret_manager_secret.db_connection: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-connection]
data.google_compute_default_service_account.default: Reading...
google_compute_network.vpc: Refreshing state... [id=projects/talana-sre-challenge-jesben/global/networks/talana-vpc]
google_secret_manager_secret.db_password: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-password]
data.google_client_config.default: Read complete after 0s [id=projects/talana-sre-challenge-jesben/regions/us-east1/zones/]
google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/724665830062/secrets/talana-db-password/versions/1]
data.google_project.current: Read complete after 0s [id=projects/talana-sre-challenge-jesben]
google_compute_router.router: Refreshing state... [id=projects/talana-sre-challenge-jesben/regions/us-east1/routers/talana-router]
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/talana-sre-challenge-jesben/global/addresses/private-ip-alloc]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/talana-sre-challenge-jesben/regions/us-east1/subnetworks/talana-subnet]
google_compute_router_nat.nat: Refreshing state... [id=talana-sre-challenge-jesben/us-east1/talana-router/talana-nat]
data.google_compute_default_service_account.default: Read complete after 0s [id=projects/talana-sre-challenge-jesben/serviceAccounts/724665830062-compute@developer.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_password_access: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-password/roles/secretmanager.secretAccessor/serviceAccount:724665830062-compute@developer.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_connection_access: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-connection/roles/secretmanager.secretAccessor/serviceAccount:724665830062-compute@developer.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Ftalana-sre-challenge-jesben%2Fglobal%2Fnetworks%2Ftalana-vpc:servicenetworking.googleapis.com]
google_sql_database_instance.main: Refreshing state... [id=talana-db-52318dc0]
google_container_cluster.primary: Refreshing state... [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster]
google_sql_database.main: Refreshing state... [id=projects/talana-sre-challenge-jesben/instances/talana-db-52318dc0/databases/talana_db]
google_sql_user.app: Refreshing state... [id=app_user//talana-db-52318dc0]
data.google_container_cluster.my_cluster: Reading...
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster/nodePools/talana-node-pool]
google_secret_manager_secret_version.db_connection: Refreshing state... [id=projects/724665830062/secrets/talana-db-connection/versions/1]
data.google_container_cluster.my_cluster: Read complete after 0s [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "server.extraArgs"
          + value = "{--insecure}"
        }
      + set {
          + name  = "server.service.type"
          + value = "LoadBalancer"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + argocd_initial_admin_password_command = "kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath='{.data.password}' | base64 -d"
  + argocd_namespace                      = "argocd"
  + argocd_server_url_command             = "kubectl -n argocd get svc argocd-server -o jsonpath='{.status.loadBalancer.ingress[0].ip}'"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @jesbensevi, Action: `pull_request`*